{"numero":"5","nombre":"window methods","explicacionJS":{"Titulo":"Mi explicación de JS","Codigo":{"LenguajeDeProgramacion":"JavaScript","Codigo":"\nfunction WindowAlert()\n{\nwindow.alert(\"Estigues alerta\");\n}\nfunction WindowPrompt()\n{\nwindow.prompt(\"Escriu Algo\");\n}\nfunction WindowConfirm()\n{\nwindow.confirm(\"Confirm?\");\n}\nfunction WindowAuto()\n{\nlet out;\ndo\n{\n\tout = true;\n  let prompt = window.prompt(\"Escriu Algo\");\n  var confirma = window.confirm(\"Segur que vols escriure \"+prompt+\"?\");\n  if(confirma)\n  {\n    window.alert(\"Segur segur segur?\");\n    out = false;\n  }\n\n}while(out);\n    \n}\n"},"Descripcion":"En el código JavaScript se definen cuatro funciones diferentes, cada una de las cuales se llama cuando se hace clic en un botón específico en el documento HTML. Cada función abre una ventana emergente diferente usando métodos como window.alert(), window.prompt() o window.confirm(). Estos métodos son proporcionados por el objeto window que representa la ventana actual en la que se está ejecutando el código JavaScript.\n\nLa función WindowAuto() es un poco más compleja. Abre una ventana emergente que solicita al usuario que escriba algo en un campo de entrada. Luego, se muestra una ventana emergente de confirmación que pregunta al usuario si está seguro de que desea escribir lo que acaba de escribir en el campo de entrada. Si el usuario confirma la acción, se muestra una segunda ventana emergente que solicita al usuario que confirme la acción nuevamente. Si el usuario confirma la acción una vez más, se sale de la ventana emergente. Si el usuario cancela alguna de las ventanas emergentes, se mantendrá la ventana emergente abierta y se repetirá el ciclo hasta que el usuario confirme la acción."},"explicacionHTML":{"Titulo":"Mi explicación de HTML","Codigo":{"LenguajeDeProgramacion":"HTML","Codigo":"<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n  <title>JS Pop-Up</title>\n</head>\n<body>\n    <button class=\"button button1\" onclick=\"WindowAuto()\">Automatic</button>\n    <button class=\"button button1\" onclick=\"WindowAlert()\">Window Alert</button>\n    <button class=\"button button1\" onclick=\"WindowPrompt()\">Window Prompt</button>\n    <button class=\"button button1\" onclick=\"WindowConfirm()\">Window Confirm</button>\n</body>\n</html>"},"Descripcion":"El código HTML es bastante sencillo. Se define un documento HTML básico con un encabezado que define el título del documento. Dentro del cuerpo del documento se definen cuatro botones que se usarán para abrir diferentes tipos de ventanas emergentes (pop-up) cuando se haga clic en ellos. Cada botón tiene un atributo onclick que llama a una función JavaScript diferente cuando se hace clic en él."},"explicacionCSS":{"Titulo":"Mi explicación de CSS","Codigo":{"LenguajeDeProgramacion":"CSS","Codigo":"/*No Hay codigo css */"},"Descripcion":"No hay contenido en el codigo css "},"embed":"https://jsfiddle.net/uristoteles/emo1c0q6/23/","descripcionGeneral":"Una pagina con  4 botones que llaman eventos de la clase window"}